Autodesk.Revit.DB.Plumbing.PipeLossMethodType
An enumerated type listing all pipe loss method types for a connector

Autodesk.Revit.DB.Plumbing.PipeLossMethodType.Coefficient
pipe loss method depend on coefficient.

Autodesk.Revit.DB.Plumbing.PipeLossMethodType.SpecificLoss
pipe loss method is specified.

Autodesk.Revit.DB.Plumbing.PipeLossMethodType.Table
pipe loss method is depend on the coefficient from table.

Autodesk.Revit.DB.Plumbing.PipeLossMethodType.NotDefined
pipe loss method is undefined.